<template>
    <div id="user_protocol" class="protocol">
        <h3>快看漫画会员自动续费服务协议</h3>
        <h4>1.服务条款的接受与修改</h4>
        <p>
            本协议是快看漫画会员（下称“会员”）与快看世界（北京）科技有限公司及（或）其关联公司、以及公司旗下相关平台的简称，平台包括但不限于快看漫画网站（网址：kuaikanmanhua.com/kkmh.com）、快看漫画APP（下称“快看漫画”）之间关于会员使用快看漫画提供的自动续费委托扣款服务（下称“本服务”）所订立的协议，本协议描述快看漫画与会员之间关于本服务的使用及相关方面的权利义务。“会员”是指享受快看漫画提供的会员服务的个人或单一实体。本协议构成会员（无论个人或者单位）使用快看漫画所提供的本服务之先决条件，除非会员接受本协议条款，否则会员无权使用本服务，会员选择使用本服务行为将视为同意接受本协议各项条款的约束。
        </p>
        <h4>2.服务说明</h4>
        <ul class="margin_vws(16)">
            <li>
                2.1
                本服务是出于会员对于自动续费的需求，在会员已开通本服务的前提下，避免会员因疏忽或其他原因导致未能及时续费造成损失而推出的服务，会员不可撤销地授权下快看漫画可在会员有效期即将过期时，从会员的自有充值账户、与会员账号绑定的第三方支付账户、银行卡、通信账户（以下统称“账户”）余额中代扣一个计费周期的费用，计费周期包括但不限于月度、季度、年度等（下同），会员可根据快看漫画平台上显示的计费周期自行选择。该服务实现的前提是会员已将其快看漫画会员账号与上述账户绑定，且可成功从其上述账户中扣款。
            </li>
            <li>
                2.2
                自动续费具体指，基于2.1的前提，快看漫画通过上述账户收取会员下一计费周期费用的扣费方式，会员需保证快看漫画可以从上述账户扣款成功，因上述账户中可扣款余额不足导致的续费失败，由会员自行承担责任。
            </li>
            <li>
                2.3
                会员在享受本服务时，会员的使用行为视为其对本服务的服务条款以及快看漫画针对本服务发出的各类公示的同意。
            </li>
            <li>
                2.4
                快看漫画向会员提供的本服务均仅限于会员在快看漫画平台使用，任何以恶意破解等非法手段将快看漫画提供的本服务与快漫画看平台分离的行为，均不属于本协议中约定的本服务。由此引起的一切法律后果由行为人负责，快看漫画将依法追究行为人的法律责任。
            </li>
        </ul>
        <h4>3.双方的权利和义务</h4>
        <ul class="margin_vws(16)">
            <li>
                3.1
                快看漫画负责向会员提供有关自动续费收费具体情况的查询方式，但不负责打印相关发票并转送会员。
            </li>
            <li>
                3.2
                快看漫画通过会员上述账户扣除下一计费周期费用的，应于开通自动续费约定时间划扣，并将款项记入会员支付记录，并同时相应延长会员有效期。
            </li>
            <li>
                3.3
                如在扣费过程出现差错，快看漫画和会员应密切配合查明原因，各自承担己方过错造成的损失；若因双方各自存在不均等过错造成损失的，由双方按过错的程度承担相应责任；因双方共同过错造成损失但无法区分各自过错的，由双方均摊责任。
            </li>
            <li>
                3.4
                快看漫画可根据其业务开展或技术升级等情况变更或修改本协议的有关服务内容、规则及条款，快看漫画将通过在快看漫画相关页面公示的方式告知用户相关变更或修改内容，但无义务另行做个别通知。如果会员不同意本协议的修改，可以取消已经获取的本服务并停止使用；如果会员继续使用快看漫画提供的服务，则视为会员已经接受本协议的全部修改。
            </li>
            <li>
                3.5
                本服务由会员自主选择是否取消，若会员选择不取消，则视为会员同意快看漫画按照一定规则进行扣款尝试，一旦扣款成功，快看漫画将为会员开通下一个计费周期的会员服务。
            </li>
            <li>3.6 若在自动续费时/之前，快看漫画服务价格发生调整，应以现时有效的价格为准。</li>
            <li>
                3.7
                快看漫画有权根据业务需要或市场变化等原因决定是否对本服务本身进行收费或调整自动续费周期及费用，并在相关页面向会员进行公示。
            </li>
        </ul>
        <h4>4.协议有效期限、终止</h4>
        <ul class="margin_vws(16)">
            <li>
                4.1 本协议自会员选择接受或使用本服务后生效，直至会员终止本服务/注销会员资格时终止。
            </li>
            <li>
                4.2
                会员有权随时在会员账号设置中选择终止本服务，终止本服务后，快看漫画将停止向会员提供本服务。
            </li>
            <li>
                4.3
                会员在选择终止本服务前已经委托快看漫画自动续费扣款的指令仍然有效，快看漫画对于基于该指令扣除的费用不予退还，由会员承担相关责任。
            </li>
        </ul>
        <h4>5.违约责任</h4>
        <ul class="margin_vws(16)">
            <li>如果一方违约，守约方有权通过双方约定的争议解决方式获得补偿。</li>
        </ul>
        <h4>6.争议解决和法律适用</h4>
        <ul class="margin_vws(16)">
            <li>
                快看漫画与会员应通过友好协商解决本协议履行过程中产生的争议，经协商无法解决的，任何一方均有权将争议提交至北京市朝阳区人民法院诉讼解决。本协议的解释、效力和执行等有关问题均适用中华人民共和国法律。
            </li>
        </ul>
        <h4>7.本协议未约定事项，按照《快看漫画服务协议》及《快看漫画会员服务协议》执行。</h4>
        <ul class="copyright">
            <li>快看世界（北京）科技有限公司</li>
            <li>Copyright © 2017 kuainkanmanhua.com All Rights Reserved</li>
        </ul>
    </div>
</template>
<script setup lang="ts"></script>
<style lang="scss" scoped>
@import '@/assets/sass/common';
body {
    margin: 0;
    padding: 0;
    font-size: vws(26);
    font-family: 'Microsoft Yahei', '宋体', Arial, Lucida, Verdana, Helvetica, sans-serif;
    color: #666;
    line-height: 150%;
}
h3 {
    font-size: vws(32);
    font-weight: normal;
    color: #000;
}
h4 {
    margin: vws(24) 0 vws(24) 0;
    font-weight: normal;
}
h5 {
    margin: vws(24) 0 vws(24) 0;
    font-size: vws(26);
    font-weight: normal;
}
h6 {
    font-size: vws(26);
    font-weight: normal;
}
a {
    font-size: vws(28);
    color: #5da4bd;
}
p,
ul,
li {
    margin: 0;
    padding: 0;
}
li {
    font-size: vws(24);
    text-align: justify;
    list-style: none;
    line-height: 2;
}
p {
    font-size: vws(24);
    text-align: justify;
    color: #666;
    line-height: 2;
}
.underline {
    text-decoration: underline;
}
.text_red {
    color: #f00;
}
.bold {
    font-weight: bold;
}
.margin_16px li {
    margin: vws(16) 0;
}
li h5 {
    margin-bottom: 0;
}
li h6 {
    margin: 0;
}
.protocol {
    margin: 0 auto;
    padding: vws(14);
    max-width: vws(800);
}
.copyright li {
    text-align: center;
}
</style>
