<template>
    <div id="user_protocol" class="protocol">
        <!-- <h3 style="text-align: center">快看漫画会员服务协议</h3> -->
        <p>本版本更新时间：2021年01月21日</p>
        <p class="bold">
            版本更新提示：主要对会员体系内容进行变更调整，对联合会员售卖、违法违规充值等进行补充说明，并对整体协议内容进行调整优化，使权利义务更清晰明了。
        </p>
        <br />
        <p>
            欢迎您使用快看漫画VIP会员服务！本协议为您（即“用户”）与快看世界（北京）科技有限公司（以下简称“快看漫画”）就快看漫画会员服务（以下称“会员服务”或“VIP会员服务”）等相关事宜所订立的协议，对双方均有同等的法律效力。
        </p>
        <p class="bold">
            您应当在使用快看漫画会员服务之前审慎阅读、充分理解本协议内容，对于协议中以加粗字体显示的内容，您应重点阅读，特别是免除或者限制责任的条款。若您为未成年人的，请您在法定监护人的陪同下阅读本协议以及确认是否同意本协议，并在法定监护人的指导下使用快看漫画会员服务。未成年人使用本协议服务的，则视为您已获得监护人的认可。
        </p>
        <p>
            如果您不同意本协议的任一或全部条款内容，请不要以确认形式（包括但不限于支付行为、或完成了成为会员的全部程序而在此过程中未向快看漫画提出关于本协议的任何异议、或使用VIP会员服务）进行下一步操作或使用快看漫画VIP会员服务。当您以确认形式进行下一步操作或使用快看漫画VIP会员服务时，即表示您与快看漫画已达成协议关系，您自愿接受本协议并遵守本协议项下的全部约定。
        </p>
        <br />
        <p>
            快看漫画有权变更本协议内容，一旦本协议内容发生变更的，快看漫画将在相应页面、站内信或以其他合理方式进行通知，请您仔细阅读。如果您不同意变更的内容的，您可以选择停止使用VIP会员服务。如您继续使用VIP会员服务的，则视为您已经同意变更的全部内容。更新后的协议自文首更新之日起生效。
        </p>
        <br />
        <h4>一、服务说明</h4>
        <p>
            1.
            【快看漫画VIP会员】是指完成了成为会员的所有程序，且在遵守本协议的前提下，在会员时长有效期内享受快看漫画提供的VIP会员服务的自然人。
        </p>
        <p>
            2.
            【快看漫画VIP会员服务】是由快看漫画向您提供的专享的会员权益，同时，快看漫画在此善意提醒您，
            <span class="bold">本协议中还有需要进行额外付费的服务，请您重点仔细阅读。</span>
        </p>
        <p>
            3.
            【快看漫画VIP会员服务协议】是《快看漫画服务协议》、《快看漫画隐私政策》的补充协议，是其不可分割的一部分，与其具有同等法律效力；本协议如与前述协议发生冲突的，以本协议为准。
        </p>
        <p>
            4.
            【快看漫画VIP会员服务规则】是快看漫画在快看漫画VIP会员中心已经或未来不时发布的与VIP会员服务相关的协议、公告、页面说明、通知、FAQ等内容。前述内容一经发布即生效，均构成本协议不可分割的一部分。
        </p>
        <br />
        <h4>二、使用服务</h4>
        <p>1. 服务获取</p>
        <p>
            1.1
            快看漫画VIP会员服务为收费服务，您可以通过支付相应的服务费用购买；同时，您亦可以通过营销活动、接受礼品卡、接受好友代开会员服务等快看漫画认可的途径获取服务。
        </p>
        <p>
            1.2
            您在获取快看漫画VIP会员服务时，应当遵守法律法规、本协议约定，不侵犯第三方或快看漫画的合法权益。您不得自行（或协助他人）通过以下方式获取VIP会员服务：
        </p>
        <p>（1） 以商业性或其他非个人使用等目的；</p>
        <p>（2） 通过机器人软件、蜘蛛软件、爬虫软件等任何自动程序、脚本、软件等方式；</p>
        <p>（3） 未经快看漫画允许通过转移、赠与、借用、租用、销售、转让VIP会员服务的方式；</p>
        <p>
            （4）
            通过不正当手段或以违反诚实信用原则的方式（如利用规则漏洞、利用系统漏洞、滥用会员身份、黑色产业、投机等）；
        </p>
        <p>（5） 通过利用或破坏快看漫画VIP会员服务规则的方式。</p>
        <p>
            快看漫画在此声明：任何未经快看漫画明示授权而销售、转让快看漫画VIP会员资格的行为属于非法销售、非法转让，快看漫画有权追究其法律责任。
        </p>
        <p>2. 服务使用的基本原则</p>
        <p>
            2.1
            您在使用快看漫画VIP会员服务的过程中，应遵守法律法规及其他规范性文件的要求，包括但不限《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《中华人民共和国网络安全法》、《信息网络传播权保护条例》等；应遵守公共秩序，尊重社会公德，不得危害网络安全，不得利用网络从事危害国家安全、荣誉和利益，煽动颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，传播暴力、淫秽色情信息，编造、传播虚假信息扰乱经济秩序和社会秩序，以及侵害他人名誉、隐私、知识产权和其他合法权益等活动。在任何情况下，快看漫画一旦合理地认为您存在上述行为的，可以在任何时候，不经事先通知终止向您提供快看漫画VIP会员服务。
        </p>
        <p>
            2.2
            快看漫画授予您对快看漫画VIP会员服务一项个人的、非独家的、不可转让的、非商业用途的、可撤销的、有期限的使用许可。即：您仅可出于个人、非商业的目的使用快看漫画VIP会员服务。
        </p>
        <p>3. 服务内容的变更</p>
        <p>
            快看漫画有权根据法律法规及政策变更、版权方要求、自身运营策略变更对VIP会员服务内容（包括但不限于VIP会员权益细则、收费标准、收费方式）进行部分或全部变更。就前述变更，快看漫画将通过相应服务页面、站内信通知或以其他合理方式进行发布，并于发布之日起生效。发布后，您继续操作的行为（包括但不限于点击同意、或继续购买、或完成支付行为、或使用VIP会员服务等），均视为您已经接受前述变更。
        </p>
        <p>4. 第三方服务内容</p>
        <p>
            若您购买联合会员服务（如：同时购买快看漫画会员服务+京东PLUS会员服务）或因购买快看漫画VIP会员服务而获赠第三方会员服务的，快看漫画仅提供快看漫画VIP会员服务，不对第三方的会员服务负责。第三方会员服务的权益、使用、收费规则等，将由第三方执行和向您解释，您亦可以前往第三方平台查询相关规则。
        </p>
        <h4>三、您的账号</h4>
        <p>1. 账号获得</p>
        <p>
            在您的VIP会员服务的有效期限内，您享有VIP会员权益的快看漫画账号即为您的快看漫画VIP会员账号（即：与您的VIP会员服务绑定的快看漫画账号，以下亦称“VIP账号”或“会员账号”）。
        </p>
        <p>
            同时，快看漫画在此善意提醒您，您应当在遵守快看漫画账号使用规则的前提下，使用您的会员账号。快看漫画建议您查阅《快看漫画服务协议》及其他相关协议、各类公告、页面说明和规范流程、FAQ等以获得更多关于账号使用规则的内容。
        </p>
        <p>2. 登录</p>
        <p>
            除您以游客模式购买快看漫画VIP会员服务的，快看漫画VIP会员服务需要您登录您的快看漫画VIP会员账号方可使用。
        </p>
        <p>3. 账号管理及安全</p>
        <p>
            3.1
            您应自行负责并妥善、正确地保管、使用、维护您的VIP会员账号和密码，并对您的账号和密码采取必要和有效的保密措施。非快看漫画法定过错导致的任何遗失、泄露、被篡改、被盗以及其他因保管、使用、维护不当而造成的损失，您应自行承担。
        </p>
        <p>
            3.2
            如果您发现有人未经授权使用了您的账号或您的账号存在其他异常情况导致无法正常登录使用的，则您需要按照快看漫画官方公布的账号找回流程进行账号找回。在找回过程中，快看漫画可能会要求您提供相应信息及/或证明资料，请确保您所提供的内容真实有效，否则将可能无法通过快看漫画的验证而导致找回失败。
        </p>
        <p>
            3.3
            为保护账号安全，防止账号被盗等情况发生，快看漫画可能会不时或定期采用一种或多种方式对账号使用者进行用户身份验证（如短信验证、邮件认证等）；如未成功通过验证的，快看漫画有合理理由怀疑该账号出现被盗等不安全情况，并视情节严重情况而决定是否中止向该账号继续提供会员服务及/或采取进一步措施。
        </p>
        <p>
            3.4
            请您特别注意，您的VIP会员账号下的行为视为您本人的行为，您应对您的VIP账号下发生的活动或通过该账号进行的活动负责。
        </p>
        <p>4. 信息查询</p>
        <p>
            您可以通过登录快看漫画VIP会员中心免费查询您的账号信息详情，包括已开通的VIP会员服务内容、服务期限、消费记录等。
        </p>
        <p>5. 登录限制</p>
        <p class="bold">
            5.1
            快看漫画VIP会员账号可在手机端、Pad端、电脑端、小程序端以及上述终端相应的网页端使用，具体适用的设备终端以快看漫画实际提供为准。
        </p>
        <p class="bold">原则上：</p>
        <p class="bold">
            （1）同一快看漫画VIP账号最多可在三个设备终端登录（手机端App一个、Pad端App一个、网页端一个、小程序端一个）；
        </p>
        <p class="bold">（2）同一快看漫画VIP账号一天最多可在三个设备终端上使用；</p>
        <p class="bold">（3）同一快看漫画VIP账号一天最多可在两个地区登录/使用。</p>
        <p class="bold">（4）同一快看漫画VIP账号同一时间最多可在三个设备终端上使用。</p>
        <p class="bold">
            若您违反上述使用规则要求，快看漫画有权在不事先通知您的情况下，对您的账号以及账号下的KK币采取封禁/冻结措施。账号被封禁/冻结后，您的VIP账号会在一定时间内将无法正常使用。您可以联系快看漫画客服或按照平台、短信提示说明进行解禁。若您的被封禁/冻结记录次数大于等于2次的，快看漫画有权不再受理您的解禁或者申诉请求，所引起的责任由您自行承担。若您违反以上规定的，快看漫画有权在不事先通知您的情况下，根据您的实际情况去修改、限制、中止、终止部分或全部您的快看漫画VIP会员服务或权益，且快看漫画无需向您进行任何赔偿、无需退还任何费用/积分。
        </p>
        <p>
            5.2
            为了您顺利使用快看漫画VIP会员服务，快看漫画在此建议您，若您超过上述限制，应当立刻采取（1）关闭其他设备终端的登录；（2）及时修改账号的密码并重新进行登录。您可以在产品中查阅、管理您的VIP账号的设备终端登录情况。
        </p>
        <p>6. 账号独立</p>
        <p>
            您的VIP账号仅限您本人出于非商业目的进行使用。除非快看漫画同意，会员权益不可在不同账号之间进行转移、迁徙、转让、赠与、售卖、租借、分享，即使前述不同账号由同一人拥有使用权。快看漫画在此善意提醒您，您在进行会员服务购买/参与活动时请注意区分，以免造成不必要的损失。
        </p>
        <p>7. 权利归属</p>
        <p>
            快看漫画VIP会员账号、VIP会员账号下的VIP会员服务、虚拟产品（商品）及其涉及的产品及/或服务的所有权及相关知识产权归快看漫画所有或经过授权使用，您仅拥有前述产品及/或服务的有限使用权。但您经合法渠道取得的实体产品所有权、账号下归属于您的个人财产、快看漫画另有说明的其他权益除外。
        </p>
        <p>8. 游客模式</p>
        <p>
            8.1
            因苹果应用商店渠道允许非注册用户通过游客方式购买VIP会员服务，会员服务将会绑定您购买会员时所用的设备，VIP会员服务也将仅可在绑定设备上使用，且部分会员权益可能会因为您使用游客模式而无法享受（如活动参与）。若您设备丢失、损坏、进行系统升级、还原、清空或其他类似行为的，将会导致您无法继续使用绑定于此设备的VIP会员权益，由此造成的您的损失，您应当自行承担。
        </p>
        <p>
            8.2
            快看漫画在此建议您按照页面操作指引绑定您的快看漫画注册账号，以便可在您所拥有的其他设备上使用会员权益及更好的享受快看漫画所提供给您的会员权益。
        </p>
        <h4>四、会员权益及额外付费相关</h4>
        <p>1. VIP会员权益</p>
        <p>
            <span class="bold">
                快看漫画VIP会员权益，包括作品提前看、作品购买折扣、限时免费阅读等，具体以快看漫画平台上VIP会员页面的说明或快看漫画实际提供为准，
            </span>
            本协议项下的会员权益名称与页面的说明不一致的，不影响您所实际享受的会员权益的内容。不同等级的VIP会员的会员权益存在差异，您在VIP会员服务项下可享受的具体会员权益以快看漫画的页面说明或快看漫画实际提供为准。
        </p>
        <p>
            快看漫画可能会根据法律法规及政策变更、版权状态变化、自身运营策略对前述会员权益作出部分修改，包括但不限于调整作品内容、停更部分视内容或下线部分内容。
        </p>
        <p>2. 设备及系统差异</p>
        <p>
            您成为VIP会员后，可能会因您使用的软件版本、设备、操作系统等不同以及其他第三方原因导致实际可使用的具体权益或服务内容有差别，由此可能给您带来的不便，您表示理解且不予追究或豁免快看漫画的相关责任。快看漫画建议您可以通过升级应用程序或操作系统版本、更换使用设备等方式来尝试解决，或者直接通过本协议提供的方式与快看漫画联系进行解决。
        </p>
        <p>3. 额外付费</p>
        <p class="bold">
            3.1
            在您的快看漫画VIP会员有效期内，您可以观看到快看漫画平台VIP专享的漫画内容，但部分内容需要您额外付费后方可观看，目前主要有如下几种：
        </p>
        <p class="bold">
            （1）付费漫画：该类漫画需要您单独支付购买费用后，您方可进行浏览阅读。快看漫画在此善意提醒您，快看漫画有权根据版权方要求及/或快看漫画实际运营需要，调整向您提供的可免费观看的内容、数量等。
        </p>
        <p class="bold">（2）其他需要您额外付费后方可浏览阅读的内容，如小说、抽卡/彩蛋卡等。</p>
        <p class="bold">
            3.2
            前述需要额外付费的服务内容，快看漫画会以显著标注向您作出提示。请您仔细阅读相关提示，并自主决定是否进行购买。
        </p>
        <p class="bold">
            快看漫画在此善意提醒您，服务内容在您付费成功后有一定的使用有效期（具体以购买页面说明为准），请您记得及时使用。在有效期满后，无论您是否使用完毕所购的服务内容，快看漫画不因此向您退还您已支付的费用且不予进行任何形式的补偿/赔偿。同时，您理解并同意，就前述额外付费的部分或全部内容，快看漫画有权根据自身运营政策之需要，在一段时间后，免费提供给用户观看。
        </p>
        <p>4. 虚拟产品</p>
        <p>
            您在使用VIP会员服务过程中可能获得由我们提供的各种积分、卡券、优惠券、代金券、福利券、成长值等虚拟产品。前述虚拟产品仅能用于快看漫画官方渠道公布的指定用途，不能退货、兑换现金或转让、买卖、置换、抵押等，在使用后亦不会恢复。
        </p>
        <p>同时，请您理解，快看漫画有权根据实际运营策略变更，变更其使用规则（包括使用有效期）。</p>
        <p>5. 活动参与</p>
        <p>
            在VIP会员服务期限内，您有权选择参加由快看漫画组织的VIP活动并享有由快看漫画提供的各项优惠。具体活动及优惠的内容及规则以快看漫画实际提供为准。
        </p>
        <p>6. 优惠政策</p>
        <p>
            快看漫画可能会根据实际运营情况对不同阶段已经购买且持续有效的VIP会员服务给予延期、权益升级等方面的优惠，具体优惠政策以快看漫画在相关服务页面通知的内容为准。
        </p>
        <p>7. 使用规范</p>
        <p>
            您在获取、使用快看漫画VIP会员服务(包括参与活动)时，应遵循快看漫画官方渠道公布的流程、平台规范等：
        </p>
        <p>
            7.1
            不得通过未经快看漫画授权或公布的途径、方式、渠道非法获取快看漫画VIP会员服务（包括但不限于部分或全部会员权益、VIP会员账号）及/或参与活动获取福利（包括但不限于会员权益、虚拟产品、实体商品、会员服务兑换码，本条下同）；
        </p>
        <p>
            7.2
            不得通过不正当手段或以违反诚实信用原则的方式（如利用规则漏洞、利用系统漏洞、滥用会员身份、黑色产业、投机等违背快看漫画提供服务/举办活动的初衷的方式）参与活动或者获取福利；
        </p>
        <p>
            若您违反上述约定，则快看漫画有权对您所获得的福利作出删除、取消、清零等处理，且有权终止向您提供服务，由此造成的全部损失由您自行承担。
        </p>
        <p>8. 服务期限</p>
        <p>
            8.1
            您的VIP会员服务的服务期限以您自行选择并支付相应会员费用对应的服务期限为准，自您成为VIP会员之时起算，您可以通过登录快看漫画VIP会员中心免费查询。该期限不因您未使用或对阅读的暂停、倒回等情况而延长。当会员服务期限到期后，快看漫画将停止继续向您提供VIP会员服务；但如您开通自动续费服务且您在服务期限到期前续费成功的，会员服务期限将在原服务期限的基础上顺延。自动续费的VIP会员服务在当前周期内的服务有效期到期前，您可以单方面停止自动续费，快看漫画亦可以根据运营策略需要而单方面停止继续向您自动续费服务，VIP会员服务期限自当前服务周期届满之日起终止。
        </p>
        <p>
            8.2
            请您理解，VIP会员服务期限中包含快看漫画解决故障、服务器维修、调整、升级等或因第三方侵权处理所需用的合理时间，对上述情况所需用的时间或造成的任何损失（如有），快看漫画不予任何形式的赔偿/补偿，但快看漫画会尽可能将影响降至最低。
        </p>
        <h4>五、收费及退订</h4>
        <p>1. 收费方式</p>
        <p>
            快看漫画VIP会员服务为收费服务，您可通过快看漫画实际支持的付费方式完成VIP会员费用的支付，如银行卡支付、第三方支付等。请您注意，若您使用您的苹果账户或与您的会员账号绑定的通信账户进行支付，此付费方式为代收费运营商托收的付款方式，您通过此种付费方式付费可能存在一定的商业风险（如不法分子利用您账户或银行卡等有价卡等进行违法活动），该等风险可能会给您造成相应的经济损失，您应自行承担全部损失。
        </p>
        <p>2.费用退还</p>
        <p>
            VIP会员服务系网络商品和虚拟商品，采用先收费后服务的方式，会员费用是您所购买的会员服务所对应的网络商品价格，而非预付款或者存款、定金、储蓄卡等性质，VIP会员服务一经开通后不可转让或退款（如因VIP会员服务存在重大瑕疵导致您完全无法使用等快看漫画违约情形、本协议另有约定、法律法规要求必须退款的或经快看漫画判断后认为可以退款等除外）。
        </p>
        <p>
            快看漫画在此特别提醒您，您在购买VIP会员服务（包括自动续费服务）之前应仔细核对账号信息、购买的服务内容、价格、服务期限等信息。
        </p>
        <p>3. 收费标准、方式的变更</p>
        <p>
            VIP会员服务（包括自动续费）、收费标准由快看漫画根据公司的运营成本、运营策略等综合考虑后独立决定（调整包括但不限于促销、涨价等），并在相关的产品服务宣传及支付页面向您展示；若您在购买和续费时，相关收费方式发生变化的，以快看漫画实际支持的收费方式为准；相关服务的价格发生了调整的，应以快看漫画平台上公示的现时有效的价格为准（但快看漫画与您另有约定的情形除外）。您同意您继续操作的行为（包括但不限于点击同意、或继续购买、或完成支付行为、或使用VIP会员服务、或进行额外付费等），即视为您知悉并同意变更后的收费方式、收费标准。
        </p>
        <p>4. 自动续费</p>
        <p>
            自动续费服务是指在会员已购买VIP会员服务的前提下，出于会员对于自动续费的需求，避免会员因疏忽或其他原因导致未能及时续费而推出的服务。如会员选择开通自动续费服务的，即会员授权快看漫画可在会员服务期限即将过期时或会员服务的订阅周期即将到期时，委托支付渠道从与您的自有充值账户、绑定的第三方支付账户、银行卡、通信账户等（以下统称“账户”）余额中代扣下一个计费周期的费用。该服务实现的前提是您已开通自动续费及绑定相关账户，且可成功从其上述账户中足额扣款。
        </p>
        <p>4.1 计费周期：如月度、季度、年度等（具体以快看漫画提供的为准），您可自行选择。</p>
        <p>4.2 自动扣款规则：</p>
        <p class="bold">
            （1）会员选择开通自动续费的，则视为同意授权快看漫画可在会员服务期限即将过期时，依据支付渠道的扣款规则发出扣款指令，并同意支付渠道可以根据快看漫画发出的扣款指令，在不验证会员账户密码、支付密码、短信校验码等信息的情况下从账户中扣划下一个计费周期的费用。苹果iOS渠道的自动扣费规则以苹果公司的规定为准。
        </p>
        <p class="bold">
            （2）除非会员或快看漫画主动明确地取消了自动续费，否则，自动扣款长期有效、不受次数限制。
        </p>
        <p class="bold">
            （3）如果您未主动明确地取消自动续费，则将视为您同意快看漫画可依据支付渠道的扣款规则在会员服务期限到期后的一定期限内进行不时的扣款尝试（即使您账户内金额不足）。
        </p>
        <p class="bold">（4）一旦扣款成功，快看漫画将为您开通本次计费周期对应的VIP会员服务。</p>
        <p>4.3 取消方式：</p>
        <p>
            （1）苹果移动设备端：苹果移动设备“APP Store” --> 点击右上角苹果账户头像，进入“账户”-->
            “订阅”，选择“快看漫画”取消订阅；
        </p>
        <p>
            （2）安卓移动设备端：快看漫画APP --> “我的”--> “快看漫画VIP”
            -->“管理自动续费”，选择“取消自动续费”；
        </p>
        <p>
            您知悉并同意，自动续费状态更新可能存在显示延时，具体以快看漫画APP内显示的您的续费状态为准。且您在成功取消前，已经委托快看漫画自动续费的扣款指令仍然有效，快看漫画对于基于该指令在取消操作完成前已经扣除的费用不予退还和补偿。
        </p>
        <h4>六、您的行为规范和违约处理</h4>
        <p>1. 在您使用快看漫画VIP会员服务的过程中，不得存在以下行为：</p>
        <p>
            1.1
            未经快看漫画明确授权，通过技术手段对服务内容、服务期限、消费金额、交易状态等信息进行修改；
        </p>
        <p>
            1.2
            将VIP会员服务通过非快看漫画明确授权的方式（包括但不限于转移、赠与、借用、租用、销售、转让）提供他人使用；
        </p>
        <p>
            1.3
            未经快看漫画明确授权，将VIP会员服务提供的内容的全部或部分进行复制、下载、上传、修改、编目排序、翻译、发行、开发、转让、销售、展示、传播、合成、嵌套、链接、创作衍生作品、进行商业开发或推广等；
        </p>
        <p>
            1.4
            对快看漫画用于保护VIP会员服务的任何安全措施技术进行破解、更改、反操作、篡改或其他破坏；
        </p>
        <p>1.5 未经快看漫画事先书面同意，删除VIP会员服务内容上的任何所有权或知识产权声明或标签；</p>
        <p>
            1.6
            未经快看漫画明确授权，采用收费或免费的方式，在任何公开场合全部或部分展示VIP会员服务内容（但如您的上述行为不构成侵权的除外）；
        </p>
        <p>
            1.7
            其他未经快看漫画明示授权许可或违反本协议、法律法规或监管政策、侵犯第三方或快看漫画合法权益的行为。
        </p>
        <p>
            2.
            您知悉并同意，如您存在或快看漫画经独立判断后认为您存在任何违反国家法律法规或监管政策、违反本协议或有损快看漫画或/及其关联公司的声誉、利益的行为的，快看漫画有权独立决定采取以下一项或多项处理措施：
        </p>
        <p>2.1 如本协议对此行为有单独条款约定处理方式的，按照该条款处理；</p>
        <p>
            2.2
            无需通知您而采取一种或多种措施制止您的行为及行为产生的后果，如删除/屏蔽相关链接或内容、限制/取消您的账号/账户使用权限等；
        </p>
        <p>
            2.3
            无需通知您而中断或终止部分或全部VIP会员服务，且您已交纳的VIP会员服务费用将不予退还且不获得任何形式的补偿/赔偿；
        </p>
        <p>
            2.4
            如您的行为使快看漫画或/及其关联公司遭受任何损失的，您应当承担全部损失赔偿责任并在快看漫画要求的时限内完成费用支付。
        </p>
        <p class="bold">
            3.您应通过快看漫画官方渠道或非快看漫画授权渠道充值/购买快看漫画VIP会员，具体官方/授权渠道以快看漫画平台公示内容为准；若您通过其他非快看漫画官方渠道或快看漫画授权渠道充值购买VIP会员的，因此所引起的责任由您自行承担，且快看漫画有权对此您获得的会员账号及会员权益进行处理，包括但不限于在不用提前通知您的情况下收回快看漫画会员/账号、短期封号、不提供因此产生的客诉服务等。
        </p>
        <h4>七、服务的中断和终止</h4>
        <p>1. 本服务的中断或终止包括如下情况：</p>
        <p>1.1 您主动提出要求的；</p>
        <p>
            1.2
            您存在或快看漫画经独立判断后认为您存在任何违反国家法律法规或监管政策、违反本协议或有损快看漫画或/及其关联公司的声誉、利益的行为的；
        </p>
        <p>1.3 快看漫画根据法律法规、监管政策的规定或有权机关的要求；</p>
        <p>1.4 快看漫画为维护账号与系统安全等紧急情况之需要；</p>
        <p>
            1.5
            不可抗力（鉴于互联网之特殊性质，不可抗力亦包括黑客攻击、电信部门技术调整导致之重大影响、因政府管制而造成之暂时关闭、病毒侵袭等影响互联网正常运行之情形）；
        </p>
        <p>1.6 其他快看漫画无法抗拒的情况。</p>
        <p>2. 当发生前述终止的情况时，您与快看漫画均认可如下处理方式：</p>
        <p>2.1 已经产生但未使用的VIP会员权益自动清除且不折现；</p>
        <p>2.2 如您在快看漫画平台内有正在进行中的交易，快看漫画届时将视情况进行合理处理；</p>
        <p>2.3 除法律法规另有规定或快看漫画另有说明外，快看漫画已收取的会员费用不予退还；</p>
        <p>2.4 如因您违反本协议导致终止的，快看漫画有权视情况要求您承担相应的违约责任；</p>
        <p>2.5 除法律法规另有规定或快看漫画另有说明外，快看漫画无需向您和第三人承担任何责任。</p>
        <h4>八、您的个人信息保护</h4>
        <p>
            1.
            快看漫画深知个人信息对您的重要性，因此快看漫画非常重视保护您的个人信息，亦将您的个人信息以高度审慎的义务对待和处理。在您使用快看漫画VIP会员服务的过程中，快看漫画将采用相关技术措施及其他安全措施来保护您的个人信息。
        </p>
        <p>2.未成年人保护</p>
        <p>快看漫画非常注重未成年人的保护。</p>
        <p>
            2.1
            若您为未成年人，应在监护人监护、指导下阅读本协议，并且使用VIP会员服务已经得到监护人的同意。
        </p>
        <p>
            2.2
            监护人应指导子女上网应该注意的安全问题，防患于未然。若监护人同意未成年人使用VIP会员服务，必须以监护人名义申请消费，并对未成年人使用VIP会员服务进行正确引导、监督。未成年人使用VIP会员服务，以及行使和履行本协议项下的权利和义务即视为已获得了监护人的认可。
        </p>
        <p>
            2.3
            快看漫画提醒未成年人在使用会员服务时，要善于网上学习，认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活。
        </p>
        <p>
            3.
            更多关于个人信息处理和保护规则、用户对个人信息的控制权等内容，请您至快看漫画平台上查阅《快看漫画政策》以及《快看漫画儿童隐私政策》的全文（例如：手机快看漫画APP的查询路径为：我的-设置-点击隐私政策/儿童隐私政策）。
        </p>
        <h4>九、通知</h4>
        <p>
            为便于您获知与本协议和VIP会员服务相关的信息，您同意快看漫画有权通过网页公示、页面提示、弹窗、消息通知、公众号通知、站内信、您预留的联系方式（如手机短信、电子邮件等）等一种或多种方式进行通知，该通知自快看漫画发送之时视为已成功送达您。如多种通知方式并存的，则送达时间以上述方式中最早发送之时为准。
            此类通知的内容或将对您产生重大有利或不利影响，请您务必确保联系方式为有效并请及时关注相应通知。
        </p>
        <h4>十、联系快看漫画</h4>
        <p>
            如您对本协议或使用VIP会员服务的过程中有任何问题（包括问题咨询、投诉等），快看漫画专门为您提供了多种反馈通道，希望为您提供满意的解决方案：
        </p>
        <p>
            （1）在线客服/其他在线意见反馈通道：您可与快看漫画平台上产品功能页面的在线客服联系或者在线提交意见反馈；
        </p>
        <p>（2）人工客服通道：您可以拨打快看漫画的任何一部客服电话与快看漫画联系；</p>
        <p>
            （3）专设的邮件通道：快看漫画专门设立了jubaoyouxiang@kkworld.com邮箱，您可以通过该邮箱与快看漫画联系；
        </p>
        <p>（4）其他方式：快看漫画提供的其他反馈通道。</p>
        <p>我们会在收到您的反馈后尽快向您答复。</p>
        <h4>十一、 其他</h4>
        <p>1.本协议的生效、履行、解释及争议的解决均适用中华人民共和国法律。</p>
        <p class="bold">
            2.如就本协议的签订、履行等发生任何争议的，双方应尽量友好协商解决；协商不成时，任何一方均可向北京市朝阳区的人民法院提起诉讼。
        </p>
        <p>
            3.如本协议因与中华人民共和国现行法律相抵触而导致部分无效的，不影响协议的其他部分的效力。
        </p>
        <p>4.本协议的标题仅为方便及阅读而设，并不影响正文中任何条款的含义或解释。</p>
        <p class="copyright">快看世界（北京）科技有限公司</p>
    </div>
</template>
<script setup lang="ts"></script>
<style lang="scss" scoped>
@import '@/assets/sass/common';
body {
    margin: 0;
    padding: 0;
    font-size: vws(26);
    font-family: 'Microsoft Yahei', '宋体', Arial, Lucida, Verdana, Helvetica, sans-serif;
    color: #666;
    line-height: 150%;
}
h3 {
    font-size: vws(32);
    font-weight: normal;
    color: #000;
}
h4 {
    margin-top: vws(24);
    margin-bottom: 0;
    font-weight: bold;
}
h5 {
    margin: vws(24) 0 vws(24) 0;
    font-size: vws(26);
    font-weight: normal;
}
h6 {
    font-size: vws(26);
    font-weight: normal;
}
a {
    font-size: vws(28);
    color: #5da4bd;
}
p,
ul {
    margin: 0;
    padding: 0;
}
p {
    font-size: vws(24);
    text-align: justify;
    color: #666;
    line-height: 1.5;
}
.underline {
    text-decoration: underline;
}
.text_red {
    color: #f00;
}
.bold {
    font-weight: bold;
}
.margin_16px p {
    margin: vws(16) 0;
}
p h5 {
    margin-bottom: 0;
}
p h6 {
    margin: 0;
}
.protocol {
    margin: 0 auto;
    padding: vws(14);
    max-width: vws(800);
}
.copyright {
    margin-top: vws(24);
    text-align: right;
}
</style>
